package main.java.com.ohgiraffers.section01.conditional.question;

import java.util.Scanner;

public class Question {

    /*
    *  a,b,c 세 과목의 점수를 스캐너로 입력 받고 세 과목의 점수를
    *  만든 메소드의 매개변수로 전달해 평균을 계산, 평균을 이용하여 합격 / 불합격  처리를 하는 기능을 구현하세요
    *  (합격 조건 : 세 과목의 점수가 각각 40점을 넘어야하고, 평균은 60을 넘어야 합니다.)
    *  합격 했을 경우 그 학생의 평균 점수와 "합격입니다!" 를 출력하고,
    *  불합격인 경우에는 "불합격 입니다!" 를 출력 해주세요.
    *
    * */

    // 1. 세 과목 점수 입력받기
    // 1-1. 스캐너를 객체를 생성하기  1-1 ~ 1-3 3번 반복
    // 1-2. 사용자에게 점수 입력 메세지
    // 1-3. 점수 저장하기

    // 2. 메소드 만들기 매개변수가 3개인
    // 2-1.매개변수로 전달받은 값이 40이 넘어서는지 확인
    // 2-2
    // 3. 합격과 불합격 처리

    Scanner scr = new Scanner(System.in);

}
